#!/usr/bin/python

'''
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

Напишите скрипт, который вернет 1 список, в котором будут элементы общие для списков
a и b. Результирующий список не должен сожердать дубликатов.
'''

a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

mnozhA = set(a)
mnozhB = set(b)

result = mnozhA & mnozhB

result = list(result)

print(result)

